ams/src/Documents/AMS_ПереработкаБрака/AMS_ПереработкаБрака.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>AMS_ПереработкаБрака</name>
  <registerRecords>InformationRegister._Зарплата</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>EnumRef._ПроизводственныеСмены</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУпаковок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураБрак</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУпаковокБрак</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УпаковкаБрак</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоБрак</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подработка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>МатериалыСтарые</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоОтходы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПереработка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МатериалыНовые</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Сырье</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Фасовка</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Подработка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Работы</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Работа</name>
      <type>
        <types>CatalogRef._Работы</types>
      </type>
    </attributes>
    <attributes>
      <name>Подработка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ams/src/InformationRegisters/_ЦеныФасовкиПродукции/_ЦеныФасовкиПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>_ЦеныФасовкиПродукции</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ams/src/InformationRegisters/_ЦеныРабот/_ЦеныРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>_ЦеныРабот</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <dimensions>
    <name>Работа</name>
    <type>
      <types>CatalogRef._Работы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ams/src/Enums/_ПроизводственныеСмены/_ПроизводственныеСмены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>_ПроизводственныеСмены</name>
  <enumValues>
    <name>Дневная</name>
  </enumValues>
  <enumValues>
    <name>Вечерняя</name>
  </enumValues>
</mdclass:Enum>

ams/src/Catalogs/УпаковкиЕдиницыИзмерения/УпаковкиЕдиницыИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УпаковкиЕдиницыИзмерения</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Номенклатура</owners>
  <owners>Catalog.НаборыУпаковок</owners>
  <attributes>
    <name>Безразмерная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВысотаЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Глубина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Числитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Знаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛинейныеРазмерыПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладскаяГруппа</name>
    <type>
      <types>CatalogRef.СкладскиеГруппыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>Типоразмер</name>
    <type>
      <types>CatalogRef.ТипоразмерыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУпаковок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоставляетсяВМногооборотнойТаре</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураМногооборотнаяТара</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактеристикаМногооборотнаяТара</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальноеКоличествоУпаковокМногооборотнойТары</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипИзмеряемойВеличины</name>
    <type>
      <types>EnumRef.ТипыИзмеряемыхВеличин</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МеждународноеСокращение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипУпаковки</name>
    <type>
      <types>EnumRef.ТипыУпаковокНоменклатуры</types>
    </type>
  </attributes>
</mdclass:Catalog>

ams/src/Documents/AMS_ПереработкаБрака/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Склад.СписокВыбора.Добавить(AMS_ВызовСервера.Цех1());
	Элементы.Склад.СписокВыбора.Добавить(AMS_ВызовСервера.Цех2());
	Элементы.Склад.СписокВыбора.Добавить(AMS_ВызовСервера.Цех3());

	МассивСотрудники = ПолучитьСотрудников(Объект.Склад);

	Элементы.ФасовкаСотрудник.СписокВыбора.ЗагрузитьЗначения(МассивСотрудники);
	Элементы.РаботыСотрудник.СписокВыбора.ЗагрузитьЗначения(МассивСотрудники);
	Элементы.РаботыРабота.СписокВыбора.ЗагрузитьЗначения(ПолучитьРаботы(Объект.Склад));

	ПоказатьДокументыПроизводства();
	
	НастройкаФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НоменклатураБракНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Парам = Новый Структура();
	Парам.Вставить("Дата",         Объект.Дата);
	Парам.Вставить("Склад",        Объект.Склад);
	Парам.Вставить("Номенклатура", Объект.НоменклатураБрак);
	
	ОткрытьФорму("Документ.AMS_ПереработкаБрака.Форма.ФормаВыбораПродукции",Парам,,,,,
		Новый ОписаниеОповещения("ВыборБракованнойПродукцииЗавершение",ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураБракПриИзменении(Элемент)
	Если Не ЗначениеЗаполнено(Объект.НоменклатураБрак) Тогда
		Объект.КоличествоБрак         = 0;
		Объект.КоличествоУпаковокБрак = 0;
		Объект.УпаковкаБрак           = Неопределено; 
		Объект.Номенклатура           = Неопределено;
		Объект.Количество             = 0;
		Объект.КоличествоУпаковок     = 0;
		Объект.Упаковка               = Неопределено;
		
		Объект.МатериалыСтарые.Очистить();
		Объект.МатериалыНовые.Очистить();
		Объект.Сырье.Очистить();
		Возврат;
	КонецЕсли;
	
	Если Не Объект.Склад = AMS_ВызовСервера.ПолучитьЦехНоменклатуры(Объект.НоменклатураБрак) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Это продукция другого цеха!.");
		Объект.НоменклатураБрак = Неопределено;
		Возврат;
	КонецЕсли;
		
	Стр = ОбщегоНазначенияУТВызовСервера.ЗначенияРеквизитовОбъекта(Объект.НоменклатураБрак, "_Упаковка, КоэффициентЕдиницыДляОтчетов");
	
	Объект.КоличествоБрак         = ПолучитьОстатокБрака(Объект.НоменклатураБрак, Объект.Дата);
	Объект.КоличествоУпаковокБрак = Объект.КоличествоБрак / Стр.КоэффициентЕдиницыДляОтчетов;
	Объект.УпаковкаБрак           = Стр._Упаковка; 
	
	ЗаполнитьМатериалыСтарые();
	
	Объект.Номенклатура       = Объект.НоменклатураБрак;
	Объект.Количество         = Объект.КоличествоБрак;
	Объект.КоличествоУпаковок = Объект.КоличествоУпаковокБрак;
	Объект.Упаковка           = Объект.УпаковкаБрак;
	
	ЗаполнитьМатериалыНовые();
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Парам = Новый Структура();
	Парам.Вставить("Дата",         Объект.Дата);
	Парам.Вставить("Склад",        Объект.Склад);
	Парам.Вставить("Номенклатура", Объект.Номенклатура);
	
	ОткрытьФорму("Документ.AMS_ПереработкаБрака.Форма.ФормаВыбораПродукции",Парам,,,,,
		Новый ОписаниеОповещения("ВыборВыходнойПродукцииЗавершение",ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	Если Не ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		Объект.Количество             = 0;
		Объект.КоличествоУпаковок     = 0;
		Объект.Упаковка               = Неопределено;
		
		Объект.МатериалыНовые.Очистить();
		Объект.Сырье.Очистить();
		Возврат;
	КонецЕсли;
	
	Если Не Объект.Склад = AMS_ВызовСервера.ПолучитьЦехНоменклатуры(Объект.НоменклатураБрак) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Это продукция другого цеха!.");
		Объект.НоменклатураБрак = Неопределено;
		Возврат;
	КонецЕсли;

	Стр = ОбщегоНазначенияУТВызовСервера.ЗначенияРеквизитовОбъекта(Объект.Номенклатура, "_Упаковка, КоэффициентЕдиницыДляОтчетов");
	
	Объект.Количество         = ПолучитьОстатокБрака(Объект.Номенклатура, Объект.Дата);
	Объект.КоличествоУпаковок = Объект.Количество / Стр.КоэффициентЕдиницыДляОтчетов;
	Объект.Упаковка           = Стр._Упаковка; 
	
	ЗаполнитьМатериалыНовые();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоУпаковокБракПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.НоменклатураБрак) Тогда
		Кфц = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Объект.НоменклатураБрак, "КоэффициентЕдиницыДляОтчетов");
		
		Объект.КоличествоБрак = Объект.КоличествоУпаковокБрак * Кфц;
		
		ЗаполнитьМатериалыСтарые();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КоличествоБракПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.НоменклатураБрак) Тогда
		Кфц = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Объект.НоменклатураБрак, "КоэффициентЕдиницыДляОтчетов");

		Объект.КоличествоУпаковокБрак = Объект.КоличествоБрак / Кфц;

		ЗаполнитьМатериалыСтарые();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КоличествоУпаковокПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		Кфц = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Объект.Номенклатура, "КоэффициентЕдиницыДляОтчетов");
		
		Объект.Количество = Объект.КоличествоУпаковок * Кфц;
	
		ЗаполнитьМатериалыНовые();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		Кфц = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Объект.Номенклатура, "КоэффициентЕдиницыДляОтчетов");
		
		Объект.КоличествоУпаковок = Объект.Количество / Кфц;
		
		ЗаполнитьМатериалыНовые();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыМатериалыСтарые

&НаКлиенте
Процедура МатериалыСтарыеКоличествоОтходыПриИзменении(Элемент)
	Стр = Элементы.МатериалыСтарые.ТекущиеДанные;

	Если Стр.КоличествоОтходы > Стр.Количество Тогда
		Стр.КоличествоОтходы = Стр.Количество;
	КонецЕсли;

	Стр.КоличествоПереработка = Стр.Количество - Стр.КоличествоОтходы;
	
	Стр.Сумма = Стр.КоличествоПереработка * Стр.Цена;
	
	ЗаполнитьМатериалыНовые();
КонецПроцедуры

&НаКлиенте
Процедура МатериалыСтарыеКоличествоПереработкаПриИзменении(Элемент)
	Стр = Элементы.МатериалыСтарые.ТекущиеДанные;

	Если Стр.КоличествоПереработка > Стр.Количество Тогда
		Стр.КоличествоПереработка = Стр.Количество;
	КонецЕсли;

	Стр.КоличествоОтходы = Стр.Количество - Стр.КоличествоПереработка;

	Стр.Сумма = Стр.КоличествоПереработка * ПолучитьЦенуМатериалаИлиФабриката(Стр.Номенклатура, Объект.Дата);

	РассчитатьНовуюЦенуПродукции();
	
	ЗаполнитьМатериалыНовые();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыМатериалыНовые

&НаКлиенте
Процедура МатериалыНовыеНоменклатураПриИзменении(Элемент)
	Стр = Элементы.МатериалыНовые.ТекущиеДанные;
	Стр.Количество = ПолучитьКоличествоМатериалаНового(Стр.Номенклатура);
	Стр.Цена       = ПолучитьЦенуМатериалаИлиФабриката(Стр.Номенклатура, Объект.Дата);
	Стр.Сумма      = Стр.Цена * Стр.Количество;
КонецПроцедуры

&НаКлиенте
Процедура МатериалыНовыеКоличествоПриИзменении(Элемент)
	Стр = Элементы.МатериалыНовые.ТекущиеДанные;
	Стр.Сумма = Стр.Цена * Стр.Количество;
КонецПроцедуры

&НаКлиенте
Процедура МатериалыНовыеЦенаПриИзменении(Элемент)
	Стр = Элементы.МатериалыНовые.ТекущиеДанные;
	Стр.Сумма = Стр.Цена * Стр.Количество;
КонецПроцедуры

&НаКлиенте
Процедура МатериалыНовыеПриИзменении(Элемент)
	РассчитатьНовуюЦенуПродукции();
	НастройкаФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСырье

&НаКлиенте
Процедура СырьеКоличествоПриИзменении(Элемент)
	Стр = Элементы.Сырье.ТекущиеДанные;
	Стр.Сумма = Стр.Цена * Стр.Количество;
КонецПроцедуры

&НаКлиенте
Процедура СырьеПриИзменении(Элемент)
	РассчитатьНовуюЦенуПродукции();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДокументыПроизводства

&НаКлиенте
Процедура ДокументыПроизводстваВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;

	Стр = Элемент.ТекущиеДанные;

	Если Стр = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ПоказатьЗначение(, Стр.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПроизводстваПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ДокументыПроизводстваПриАктивизацииСтрокиОбработчикОжидания", 0.1, Истина);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыФасовка

&НаКлиенте
Процедура ФасовкаСотрудникПриИзменении(Элемент)
	Стр = Элементы.Фасовка.ТекущиеДанные;

	Стр.Номенклатура = Объект.Номенклатура;
	Стр.Подработка   = 1;
	Стр.Цена         = ПолучитьЦенуФасовки();
	Стр.Количество   = Объект.КоличествоУпаковок - Объект.Фасовка.Итог("Количество");
	Стр.Сумма        = Стр.Цена * Стр.Количество * Стр.Подработка;
КонецПроцедуры

&НаКлиенте
Процедура ФасовкаПодработкаПриИзменении(Элемент)
	Стр = Элементы.Фасовка.ТекущиеДанные;

	Стр.Сумма = Стр.Цена * Стр.Количество * Стр.Подработка;
КонецПроцедуры

&НаКлиенте
Процедура ФасовкаКоличествоПриИзменении(Элемент)
	Стр = Элементы.Фасовка.ТекущиеДанные;

	Если Объект.КоличествоУпаковок - Объект.Фасовка.Итог("Количество") < 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Нельзя расфасовать больше, чем " + Объект.КоличествоУпаковок + " "
			+ Объект.Упаковка);

		Стр.Количество = 0;
	КонецЕсли;

	Стр.Сумма = Стр.Цена * Стр.Количество * Стр.Подработка;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРаботы

&НаКлиенте
Процедура РаботыСотрудникПриИзменении(Элемент)
	Стр = ТекущийЭлемент.ТекущиеДанные;

	Если Объект.Смена = ПредопределенноеЗначение("Перечисление._ПроизводственныеСмены.Дневная") Тогда
		Стр.Подработка = ?(Стр.Подработка = 0, 1, Стр.Подработка);
	Иначе
		Стр.Подработка = ?(Стр.Подработка = 0, 1.5, Стр.Подработка);
	КонецЕсли;

	Стр.Количество = ?(Стр.Количество = 0, 1, Стр.Количество);
КонецПроцедуры

&НаКлиенте
Процедура РаботыРаботаПриИзменении(Элемент)
	Стр = ТекущийЭлемент.ТекущиеДанные;

	Стр.Цена  = ПолучитьСтоимостьРаботы(Стр.Работа, Объект.Дата);
	Стр.Сумма = Стр.Цена * Стр.Количество * Стр.Подработка;
КонецПроцедуры

&НаКлиенте
Процедура РаботыПодработкаПриИзменении(Элемент)
	Стр = ТекущийЭлемент.ТекущиеДанные;

	Стр.Цена  = ПолучитьСтоимостьРаботы(Стр.Работа, Объект.Дата);
	Стр.Сумма = Стр.Цена * Стр.Количество * Стр.Подработка;
КонецПроцедуры

&НаКлиенте
Процедура РаботыКоличествоПриИзменении(Элемент)
	Стр = ТекущийЭлемент.ТекущиеДанные;

	Стр.Цена  = ПолучитьСтоимостьРаботы(Стр.Работа, Объект.Дата);
	Стр.Сумма = Стр.Цена * Стр.Количество * Стр.Подработка;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтчетОДвиженииТовара(Команда)
	ОткрытьФорму("Отчет.AMS_ДвижениеТоваров.Форма", , ЭтотОбъект, "Движение" + ОбщегоНазначенияКлиент.ДатаСеанса(), , , ,
		РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура ДвижениеДокумента(Команда)
	СсылкаНаОбъект = Объект.Ссылка;

	Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ВидимостьКомандВариантовОтчетов", Ложь);
		ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
		ПараметрыФормы.Вставить("ПараметрКоманды", СсылкаНаОбъект);

		ОткрытьФорму("Отчет.ДвиженияДокумента.Форма", ПараметрыФормы, ЭтотОбъект, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеДокументы(Команда)
	МенюОтчетыУТКлиент.СтруктураПодчиненности(Объект.Ссылка, Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСырьеПоСпецификации(Команда)
	ЗаполнитьСырье();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиОжидания

&НаКлиенте
Процедура ДокументыПроизводстваПриАктивизацииСтрокиОбработчикОжидания()
	ТекущиеДанные = Элементы.ДокументыПроизводства.ТекущиеДанные;

	Если Не ТекущиеДанные = Неопределено Тогда
		ПоказатьТоварыДокументыПроизводства(ТекущиеДанные.Ссылка, ТекущиеДанные.Операция);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПоказатьТоварыДокументыПроизводства(Ссылка, Операция)
	ИмяСсылка = Ссылка.Метаданные().Имя;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка); 
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.НомерСтроки КАК НомерСтроки,
	|	т.Номенклатура КАК Номенклатура,
	|	т.Номенклатура.ЕдиницаИзмерения КАК Ед,
	|	т.Количество КАК Количество,
	|	т.Количество / т.Номенклатура.КоэффициентЕдиницыДляОтчетов КАК КоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА т.Номенклатура._Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА т.Номенклатура.ЕдиницаДляОтчетов
	|		ИНАЧЕ т.Номенклатура._Упаковка
	|	КОНЕЦ КАК Упаковка
	|ИЗ
	|	Документ." + ИмяСсылка + ".Товары КАК т
	|ГДЕ
	|	т.Ссылка = &Ссылка"; 
	
	ДокументыПроизводстваТовары.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры  

#КонецОбласти

&НаСервере
Процедура ПоказатьДокументыПроизводства()
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Табл = AMS_Сервер.ПолучитьДокументыПереработкиБрака(Объект.Ссылка);
		ДокументыПроизводства.Загрузить(Табл);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыборБракованнойПродукцииЗавершение(Результат,ДополнительныеПераметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Объект.НоменклатураБрак       = Результат.Номенклатура;
	Объект.КоличествоУпаковокБрак = Результат.КоличествоУпаковок;
	Объект.КоличествоБрак         = Результат.Количество;
	Объект.УпаковкаБрак           = Результат.Упаковка;
	
	ЗаполнитьМатериалыСтарые();
	
	Объект.Номенклатура       = Объект.НоменклатураБрак;
	Объект.Количество         = Объект.КоличествоБрак;
	Объект.КоличествоУпаковок = Объект.КоличествоУпаковокБрак;
	Объект.Упаковка           = Объект.УпаковкаБрак;
	
	ЗаполнитьМатериалыНовые();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМатериалыСтарые()
	Если Не ЗначениеЗаполнено(Объект.НоменклатураБрак) Тогда
		Возврат;
	КонецЕсли;
	
	Материалы = AMS_ВызовСервера.ПолучитьСоставОсновнойСпецификации(Объект.НоменклатураБрак);
	
	Объект.МатериалыСтарые.Очистить();
	
	Для Каждого Стр Из Материалы Цикл
		НовСтр = Объект.МатериалыСтарые.Добавить();
		
		НовСтр.Номенклатура = Стр.Номенклатура;
		НовСтр.Количество   = Стр.КоличествоМатериал * Объект.КоличествоУпаковокБрак;
		
		//@skip-check query-in-loop
		НовСтр.Цена = ПолучитьЦенуМатериалаИлиФабриката(НовСтр.Номенклатура, Объект.Дата);
		
		Если AMS_ВызовСервера.ЭтоФабрикат(НовСтр.Номенклатура) Тогда
			НовСтр.КоличествоПереработка = НовСтр.Количество;
		Иначе
			НовСтр.КоличествоОтходы = НовСтр.Количество;
		КонецЕсли;
		
		НовСтр.Сумма = НовСтр.КоличествоПереработка * НовСтр.Цена;
	КонецЦикла; 

	РассчитатьНовуюЦенуПродукции();
КонецПроцедуры

&НаКлиенте
Процедура ВыборВыходнойПродукцииЗавершение(Результат,ДополнительныеПераметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Объект.Номенклатура       = Результат.Номенклатура;
	Объект.КоличествоУпаковок = Результат.КоличествоУпаковок;
	Объект.Количество         = Результат.Количество;
	Объект.Упаковка           = Результат.Упаковка;
	
	ЗаполнитьМатериалыНовые();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМатериалыНовые()
	Если Не ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		Возврат;
	КонецЕсли;
	
	Материалы = AMS_ВызовСервера.ПолучитьСоставОсновнойСпецификации(Объект.Номенклатура);
	
	Объект.МатериалыНовые.Очистить();
	
	Для Каждого Стр Из Материалы Цикл
		Если AMS_ВызовСервера.ЭтоФабрикат(Стр.Номенклатура) И Объект.НоменклатураБрак = Объект.Номенклатура Тогда
			Продолжить;
		КонецЕсли;	
			
		НовСтр = Объект.МатериалыНовые.Добавить();
		
		НовСтр.Номенклатура = Стр.Номенклатура;
		НовСтр.Количество   = Стр.КоличествоМатериал * Объект.КоличествоУпаковок;
		
		//@skip-check query-in-loop
		НовСтр.Цена  = ПолучитьЦенуМатериалаИлиФабриката(НовСтр.Номенклатура, Объект.Дата);
		НовСтр.Сумма = НовСтр.Количество * НовСтр.Цена;
	КонецЦикла; 
	
	РассчитатьНовуюЦенуПродукции();
	
	НастройкаФормы();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСырье()
	Для Каждого СтрМатериалыНовые Из Объект.МатериалыНовые Цикл
		Если AMS_ВызовСервера.ЭтоФабрикат(СтрМатериалыНовые.Номенклатура) Тогда
			Прервать;
		КонецЕсли;				
	КонецЦикла;

	Если ЗначениеЗаполнено(СтрМатериалыНовые.Номенклатура) Тогда
		Фабрикат           = СтрМатериалыНовые.Номенклатура;
		КоличествоФабрикат = СтрМатериалыНовые.Количество;
		
		Объект.Сырье.Очистить();
		
		Материалы = AMS_ВызовСервера.ПолучитьСоставОсновнойСпецификации(Фабрикат);
	
		Для Каждого Стр Из Материалы Цикл
			НовСтр = Объект.Сырье.Добавить();
			
			НовСтр.Номенклатура = Стр.Номенклатура;
			НовСтр.Количество   = Стр.КоличествоМатериал * КоличествоФабрикат / Стр.КоличествоФабрикат;
			
			//@skip-check query-in-loop
			НовСтр.Цена  = ПолучитьЦенуМатериалаИлиФабриката(НовСтр.Номенклатура, Объект.Дата);
			НовСтр.Сумма = НовСтр.Количество * НовСтр.Цена;
		КонецЦикла; 
	КонецЕсли;

	РассчитатьНовуюЦенуПродукции();
	
	НастройкаФормы();
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьНовуюЦенуПродукции()
	Для Каждого Стр Из Объект.МатериалыНовые Цикл
		Если AMS_ВызовСервера.ЭтоФабрикат(Стр.Номенклатура) И Стр.Количество > 0 Тогда
			Стр.Сумма = Объект.Сырье.Итог("Сумма");
			Стр.Цена  = Стр.Сумма / Стр.Количество;
			Прервать;
		КонецЕсли;				
	КонецЦикла;
	
	Объект.Цена = (Объект.МатериалыСтарые.Итог("Сумма") + Объект.МатериалыНовые.Итог("Сумма")) / ?(Объект.Количество = 0, 1, Объект.Количество);
КонецПроцедуры

&НаСервере
Функция ПолучитьЦенуФасовки()
	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("Номенклатура", Объект.Номенклатура);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.Цена КАК Цена
	|ИЗ
	|	РегистрСведений._ЦеныФасовкиПродукции.СрезПоследних(&Дата, Номенклатура = &Номенклатура) КАК т";

	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Возврат 0;
	Иначе
		Выб = Рез.Выбрать();
		Выб.Следующий();
		Возврат Выб.Цена;
	КонецЕсли;
КонецФункции

&НаСервере
Функция ПолучитьКоличествоМатериалаНового(МатериалНовый)
	Если ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Владелец", Объект.Номенклатура);
		Запрос.УстановитьПараметр("МатериалНовый", МатериалНовый);
		Запрос.УстановитьПараметр("КоличествоУпаковок", Объект.КоличествоУпаковок);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	т.КоличествоУпаковок * &КоличествоУпаковок КАК Количество
		|ИЗ
		|	Справочник._ВариантыСпецификацийНоменклатуры.Товары КАК т
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры КАК д
		|		ПО т.Ссылка = д.Ссылка
		|ГДЕ
		|	д.Владелец = &Владелец
		|	И д.Основной
		|	И т.Номенклатура = &МатериалНовый";

		Рез = Запрос.Выполнить();
		Выб = Рез.Выбрать();
		Выб.Следующий();
		Возврат Выб.Количество;

	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции

&НаСервере
Процедура НастройкаФормы()
	ЕстьФабрикат = Ложь;
	Для Каждого Стр Из Объект.МатериалыНовые Цикл
		Если AMS_ВызовСервера.ЭтоФабрикат(Стр.Номенклатура) Тогда
			ЕстьФабрикат = Истина;
			Прервать;
		КонецЕсли;				
	КонецЦикла;
	Элементы.Сырье.Доступность = ЕстьФабрикат;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЦенуМатериалаИлиФабриката(Номенклатура, Дата)
	МВТ = Новый МенеджерВременныхТаблиц;

	Если AMS_ВызовСервера.ЭтоФабрикат(Номенклатура) Тогда
		Товары = Справочники._ВариантыСпецификацийНоменклатуры.ПолучитьСоставОсновнойСпецификации(Номенклатура);
		
		Парам = Новый Структура;
		Парам.Вставить("Дата", Дата);
		Парам.Вставить("Номенклатура", Товары.ВыгрузитьКолонку("Номенклатура"));
		
		AMS_ВызовСервера.ПолучитьСтоимостьТовара(МВТ, Парам);
		
		Запрос = Новый Запрос;
		
		Запрос.МенеджерВременныхТаблиц = МВТ;
		
		Запрос.УстановитьПараметр("Товары", Товары);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.КоличествоМатериал КАК КоличествоМатериал,
		|	Товары.КоличествоФабрикат КАК КоличествоФабрикат
		|ПОМЕСТИТЬ Материалы
		|ИЗ
		|	&Товары КАК Товары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ЕСТЬNULL(ЦенаТовара.Цена, 0) * т.КоличествоМатериал / т.КоличествоФабрикат) КАК Цена
		|ИЗ
		|	Материалы КАК т
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЦенаТовара КАК ЦенаТовара
		|		ПО т.Номенклатура = ЦенаТовара.Номенклатура";
		
		Рез = Запрос.Выполнить();
		Выб = Рез.Выбрать();
		Выб.Следующий();
		
		Возврат Выб.Цена;
	
	Иначе
		Парам = Новый Структура;
		Парам.Вставить("Дата", Дата);
		Парам.Вставить("Номенклатура", Номенклатура);
		
		AMS_ВызовСервера.ПолучитьСтоимостьТовара(МВТ, Парам);
		
		Запрос = Новый Запрос;
		
		Запрос.МенеджерВременныхТаблиц = МВТ;
		
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	т.Номенклатура КАК Номенклатура,
		|	т.Цена КАК Цена
		|ИЗ
		|	ЦенаТовара КАК т
		|ГДЕ
		|	т.Номенклатура = &Номенклатура";
		
		Рез = Запрос.Выполнить();
		
		Если Рез.Пустой() Тогда
			Возврат 0;
		
		Иначе
			Выб = Рез.Выбрать();
			Выб.Следующий();
			
			Возврат Выб.Цена;
		КонецЕсли;
	КонецЕсли;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьОстатокБрака(Номенклатура, Дата)
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Склад", AMS_ВызовСервера.СкладБракованнойПродукции());
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.ВНаличииОстаток КАК Количество
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(&Дата, Склад = &Склад
	|	И Номенклатура = &Номенклатура) КАК т";

	Рез = Запрос.Выполнить();

	Если Рез.Пустой() Тогда
		Возврат 0;

	Иначе
		Выб = Рез.Выбрать();
		Выб.Следующий();
		Возврат Выб.Количество;
	КонецЕсли;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСтоимостьРаботы(Работа, Дата)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Работа", Работа);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Работа КАК Работа,
	|	т.Цена КАК Цена
	|ИЗ
	|	РегистрСведений._ЦеныРабот.СрезПоследних(&Дата, Работа = &Работа) КАК т";
	Рез = Запрос.Выполнить();

	Если Рез.Пустой() Тогда
		Возврат 0;
	Иначе
		Выб = Рез.Выбрать();
		Выб.Следующий();
		Возврат Выб.Цена;
	КонецЕсли;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСотрудников(Склад)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ФизическиеЛица КАК т
	|ГДЕ
	|	НЕ т.ПометкаУдаления
	|	И НЕ т.ЭтоГруппа
	|	И т._РаботникПроизводства
	|	И т._Склад = &Склад
	|
	|УПОРЯДОЧИТЬ ПО
	|	т.Наименование";

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьРаботы(Склад)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник._Работы КАК т
	|ГДЕ
	|	т.Склад = &Склад
	|	И НЕ т.ПометкаУдаления
	|	И НЕ т.Предопределенный
	|
	|УПОРЯДОЧИТЬ ПО
	|	т.Наименование";

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
КонецФункции

#КонецОбласти
